package com.example.bookworm.modules.bookGrid.data

import com.example.bookworm.R
import com.example.bookworm.modules.viewModel.BookInfo

var bookListAR = listOf(
    BookInfo(
        id = 0,
        title = "الشفق",
        author = "ستيفاني ماير",
        genre = "رومانسي",
        desc = "بيلا سوان البالغة من العمر سبعة عشر عامًا تعانق والدتها وداعًا في فينيكس. تستقل الطائرة التي ستنقلها إلى أكثر الأماكن أمطارًا في الولايات المتحدة: بلدة فوركس الصغيرة في واشنطن، حيث ستعيش بيلا مع والدها تشارلي. تعرف بيلا أنها ستكره فوركس، لكن الأمور تبدأ في التحسن عندما يلتقطها تشارلي ويكشف لها أنه اشترى بالفعل شاحنة شيفروليه قديمة لبيلا من صديقه بيلي بلاك.",
        image = R.drawable.twilight.toString()
    ),
    BookInfo(
        id = 1,
        title = "البلبل",
        author = "كريستين هانا",
        genre = "الخيال التاريخي",
        desc = "في عام ١٩٩٥، تعيش امرأة مسنة في ولاية أوريغون، تعاني من مرض عضال، وتتأمل في ماضيها والأسرار التي أخفتها عن عائلتها. في صندوق قديم في علية منزلها، تنظر إلى بطاقة هوية فرنسية تحمل اسم جولييت جيرفيز. قبل عقود، في فرنسا، تخلى والدهما عن شقيقتين، فيان وإيزابيل، بعد وفاة والدتهما. تزوجت فيان، الشقيقة الكبرى، من حبيب طفولتها، أنطوان، وبعد عدة حالات إجهاض، رُزقا بابنة اسمها صوفي. تعيش الثلاث معًا بسلام في منزلهن، لو جاردان، في بلدة كاريفو الريفية.",
        image = R.drawable.the_nightingale.toString()
    ),
    BookInfo(
        id = 2,
        title = "ألعاب الجوع",
        author = "سوزان كولينز",
        genre = "يافعين",
        desc = "تستيقظ كاتنيس إيفردين في يوم الحصاد، عندما يتم اختيار المشاركين في ألعاب الجوع. تنام والدتها وشقيقتها الصغيرة، بريم، في مكان قريب. توفي والدها في انفجار لغم قبل سنوات. تذهب للصيد في الغابة خارج منطقتها، المنطقة 12، مع جيل، صديقها المقرب. في تلك الليلة، في حفل الحصاد، يلقي العمدة خطابًا يصف كيف انهارت حكومات أمريكا الشمالية ونهضت دولة بانيم مكانها. نشبت حرب بين الكابيتول والمقاطعات. انتصر الكابيتول، وكتذكير لهزيمتهم، يقيم الكابيتول ألعاب الجوع كل عام. ثم يقدم العمدة هايميتش أبيرناثي، الفائز الوحيد على قيد الحياة في ألعاب الجوع من المنطقة 12، وهو ثمل للغاية لدرجة أنه ينتهي به الأمر بالسقوط في قيئه.",
        image = R.drawable.hunger_games.toString()
    ),
    BookInfo(
        id = 3,
        title = "غاتسبي العظيم",
        author = "ف. سكوت فيتزجيرالد",
        genre = "مأساوي",
        desc = "نيك كاراواي، شاب من مينيسوتا، ينتقل إلى نيويورك في صيف عام ١٩٢٢ ليتعلم عن تجارة السندات. يستأجر منزلًا في حي ويست إيج في لونغ آيلاند، وهي منطقة ثرية لكنها غير عصرية يسكنها الأثرياء الجدد، وهم فئة كونوا ثرواتهم مؤخرًا جدًا بحيث لم يتمكنوا من بناء علاقات اجتماعية، ويميلون إلى إظهار ثرواتهم بشكل مبالغ فيه. جار نيك في ويست إيج هو رجل غامض يُدعى جاي غاتسبي، يعيش في قصر قوطي ضخم ويقيم حفلات باذخة كل ليلة سبت.",
        image = R.drawable.great_gasby.toString()
    ),
    BookInfo(
        id = 4,
        title = "الخطيئة المزدوجة",
        author = "أجاثا كريستي",
        genre = "غموض",
        desc = "عندما يقضي هيركول بوارو عطلة في إيبرماوث مع صديقه هاستينغز، لم يتوقع أن تتحول إلى قضية. ولكن عندما تطلب شابة تُدعى ماري دورانت المساعدة من بوارو بعد اختفاء مجسمات مُرسلة بالبريد إلى عميل، ينطلق المحقق العظيم إلى العمل. هل فُقدت المجسمات ببساطة أم سُرقت عمدًا؟ وإذا سُرقت، فمن سرقها؟ يجب على بوارو الاعتماد على خلاياه الرمادية الصغيرة لكشف اللغز وتحديد الجاني الحقيقي.",
        image = R.drawable.double_sin.toString()
    ),
    BookInfo(
        id = 5,
        title = "الخطأ في نجومنا",
        author = "جون جرين",
        genre = "رومانسي",
        desc = "تحضر هازل غريس لانكستر، البالغة من العمر سبعة عشر عامًا، على مضض مجموعة دعم لمرضى السرطان بناءً على طلب والدتها. وبسبب إصابتها بالسرطان، تستخدم خزان أكسجين متنقل للتنفس بشكل صحيح. في أحد الاجتماعات، لفتت انتباه مراهق، وخلال الاجتماع علمت أن اسم الصبي هو أوغسطس ووترز. كان هناك لدعم صديقهما المشترك، إسحاق. كان لدى إسحاق ورم في إحدى عينيه أزاله، والآن عليه استئصال عينه الأخرى أيضًا. بعد انتهاء الاجتماع، اقترب أوغسطس من هازل وأخبرها أنها تشبه ناتالي بورتمان في فيلم دعا هازل إلى منزله لمشاهدة الفيلم، وأثناء التسكع، ناقش الاثنان تجربتهما مع السرطان. كشفت هازل أنها مصابة بسرطان الغدة الدرقية الذي انتشر إلى رئتيها. كان أوغسطس مصابًا بسرطان العظم، لكنه الآن شُفي من السرطان بعد بتر ساقه.",
        image = R.drawable.the_fault_in_our_stars.toString()
    )
)